# GetMovedBarTransform Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..GetMovedBarTransform Method
Rebar Class See Also
---
Returns a transform representing the movement of the bar relative to its default position along the distribution path.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public Transform GetMovedBarTransform(
	int barPositionIndex
)
```

Visual Basic
---
```text
Public Function GetMovedBarTransform ( _
	barPositionIndex As Integer _
) As Transform
```

Visual C++
---
```text
public:
Transform^ GetMovedBarTransform(
	int barPositionIndex
)
```

# ### Parameters
barPositionIndex
    Type: System..::..Int32 The bar index.
# ### Return Value
The transform representing the movement of the bar relative to its default position along the distribution path.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ]. |

# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace